name: "TestNet"
input: "data"
input_shape {
  dim: 1 # batchsize
  dim: 1 # number of colour channels - rgb
  dim: 28 # width
  dim: 28 # height
}

layer {
  name: "axpbypower"
  type: "Axpbypower"
  bottom: "data"
  top: "data_out"
  axpbypower_param {
    power : 2
    alpha : 3
    beta : 1
  }
}
